# Suspicious Script Content

# Description
analyzes device events over the past 90 days to detect potentially malicious or suspicious script content. It specifically filters events related to script execution, such as PowerShell, CMD, and other scripting engines, and checks for the presence of various suspicious keywords and commands. The script then categorizes and summarizes these findings, providing a count of occurrences, the distinct count of detected script contents, the distinct count of affected devices, and a sample set of the detected script contents for each type of suspicious content. This aids in identifying and investigating potential security threats posed by script-based attacks or unauthorized script execution on monitored devices.

# Sentinel / Defender
```kql
DeviceEvents
| where TimeGenerated > ago(90d)
| where ActionType == "ScriptContent"
| extend ScriptContent = tostring(parse_json(AdditionalFields)['ScriptContent'])
| extend contentdetected = case(
                               ScriptContent has "eval",
                               "eval",
                               ScriptContent has "Function",
                               "Function",
                               ScriptContent has "base64",
                               "base64",
                               ScriptContent has "powershell",
                               "powershell",
                               ScriptContent has "cmd.exe",
                               "cmd.exe",
                               ScriptContent has "wscript",
                               "wscript",
                               ScriptContent has "cscript",
                               "cscript",
                               ScriptContent has "Invoke-WebRequest",
                               "Invoke-WebRequest",
                               ScriptContent has "curl",
                               "curl",
                               ScriptContent has "wget",
                               "wget",
                               ScriptContent has "reg add",
                               "reg add",
                               ScriptContent has "reg delete",
                               "reg delete",
                               ScriptContent has "mshta",
                               "mshta",
                               ScriptContent has "bitsadmin",
                               "bitsadmin",
                               ScriptContent has "certutil",
                               "certutil",
                               ScriptContent has "net user",
                               "net user",
                               ScriptContent has "whoami /priv",
                               "whoami /priv",
                               ScriptContent has "secpol.msc",
                               "secpol.msc",
                               ScriptContent has "mimikatz",
                               "mimikatz",
                               ScriptContent has "meterpreter",
                               "meterpreter",
                               ScriptContent has "nc.exe",
                               "nc.exe",
                               ScriptContent has "psexec",
                               "psexec",
                               ScriptContent has "wmic",
                               "wmic",
                               ScriptContent has "7z",
                               "7z",
                               ScriptContent has "rar",
                               "rar",
                               ScriptContent has "schtasks",
                               "schtasks",
                               ScriptContent has "startup",
                               "startup",
                               ScriptContent has "setTimeout",
                               "setTimeout",
                               ScriptContent has "setInterval",
                               "setInterval",
                               ScriptContent has "hex",
                               "hex",
                               ScriptContent has "iex",
                               "iex",
                               ScriptContent has "New-Object System.Net.WebClient",
                               "New-Object System.Net.WebClient",
                               ScriptContent has "fromCharCode",
                               "fromCharCode",
                               ScriptContent has "String.fromCharCode",
                               "String.fromCharCode",
                               ScriptContent has "escape",
                               "escape",
                               ScriptContent has "unescape",
                               "unescape",
                               ScriptContent has "window.location",
                               "window.location",
                               ScriptContent has "nc -e",
                               "nc -e",
                               ScriptContent has "nc.exe -e",
                               "nc.exe -e",
                               ScriptContent has "bypass",
                               "bypass",
                               ScriptContent has "downloadString",
                               "downloadString",
                               ScriptContent has "Invoke-Command",
                               "Invoke-Command",
                               ScriptContent has "Get-Content",
                               "Get-Content",
                               ScriptContent has "Start-Process",
                               "Start-Process",
                               ScriptContent has "Start-Sleep",
                               "Start-Sleep",
                               ScriptContent has "Add-MpPreference -ExclusionPath",
                               "Add-MpPreference -ExclusionPath",
                               ScriptContent has "Write-Host",
                               "Write-Host",
                               ScriptContent has "Set-Service",
                               "Set-Service",
                               ScriptContent has "Get-ScheduledTask",
                               "Get-ScheduledTask",
                               ScriptContent has "Get-WmiObject",
                               "Get-WmiObject",
                               ScriptContent has "wmic process call create",
                               "wmic process call create",
                               ScriptContent has "Invoke-Expression",
                               "Invoke-Expression",
                               ScriptContent has "Invoke-Item",
                               "Invoke-Item",
                               ScriptContent has "Invoke-WebRequest",
                               "Invoke-WebRequest",
                               ScriptContent has "Invoke-Mimikatz",
                               "Invoke-Mimikatz",
                               ScriptContent has "Get-NetUser",
                               "Get-NetUser",
                               ScriptContent has "Get-Process",
                               "Get-Process",
                               ScriptContent has "Get-EventLog",
                               "Get-EventLog",
                               "None" // Default value if no suspicious string is detected
                           )
| where contentdetected != "None" // Filter out rows where no suspicious string was detected
| where DeviceName contains "@{variables('tid')}"
| summarize count(), dcount(ScriptContent), dcount(DeviceName), make_set(ScriptContent, 5) by contentdetected

```
